In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randint
df1 = pd.read_clipboard()
df1

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    41    20    11    52    10    82
C    12    61    41    99    12    28
D     3    75    19    38    64    80
E    71    91    72    81    97    65
F    25    52    83    76    44    95

In [2]:
# Tỉnh tổng của từng cột
df1.sum()

col1    170
col2    360
col3    239
col4    414
col5    243
col6    444
dtype: int64

In [3]:
# Tính tổng từg dòng
df1.sum(axis = 1)

A    270
B    216
C    253
D    279
E    477
F    375
dtype: int64

In [8]:
# Lấy ra giá trị max của từng cột
print(df1)
df1.max()

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    41    20    11    52    10    82
C    12    61    41    99    12    28
D     3    75    19    38    64    80
E    71    91    72    81    97    65
F    25    52    83    76    44    95

col1    71
col2    91
col3    83
col4    99
col5    97
col6    95
dtype: int64

In [7]:
# Lấy ra tên của dòng chứa giá trị lớn nhất trong từng cột
print(df1)
df1.idxmax()

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    41    20    11    52    10    82
C    12    61    41    99    12    28
D     3    75    19    38    64    80
E    71    91    72    81    97    65
F    25    52    83    76    44    95

col1    E
col2    E
col3    F
col4    C
col5    E
col6    F
dtype: object

In [9]:
# Cộng dồn giá trị của từng dòng trong cột với nhau rồi dùng làm giá trị
print(df1)
df1.cumsum()

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    41    20    11    52    10    82
C    12    61    41    99    12    28
D     3    75    19    38    64    80
E    71    91    72    81    97    65
F    25    52    83    76    44    95

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    59    81    24   120    26   176
C    71   142    65   219    38   204
D    74   217    84   257   102   284
E   145   308   156   338   199   349
F   170   360   239   414   243   444

In [11]:
# Tóm tắt thống kê khung dữ liệu
print(df1)
df1.describe()

   col1  col2  col3  col4  col5  col6
A    18    61    13    68    16    94
B    41    20    11    52    10    82
C    12    61    41    99    12    28
D     3    75    19    38    64    80
E    71    91    72    81    97    65
F    25    52    83    76    44    95

            col1       col2       col3      col4       col5       col6
count   6.000000   6.000000   6.000000   6.00000   6.000000   6.000000
mean   28.333333  60.000000  39.833333  69.00000  40.500000  74.000000
std    24.524817  23.883048  31.256466  21.65179  34.927067  25.051946
min     3.000000  20.000000  11.000000  38.00000  10.000000  28.000000
25%    13.500000  54.250000  14.500000  56.00000  13.000000  68.750000
50%    21.500000  61.000000  30.000000  72.00000  30.000000  81.000000
75%    37.000000  71.500000  64.250000  79.75000  59.000000  91.000000
max    71.000000  91.000000  83.000000  99.00000  97.000000  95.000000

In [26]:
# 
nd = np.nan
A = [1,2,3]
B = [4,nd,6]
C = [nd, 8, nd]
D = [nd, nd, nd]
df2 = DataFrame([A, B, C, D])
df2

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [27]:
# Xóa những dòng nan
df2.dropna()

     0    1    2
0  1.0  2.0  3.0

In [28]:
# Nếu như tất cả nan với drop, không sẽ chừa lại
print(df2)
df2.dropna(how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN

In [35]:
# Xóa số dòng tính từ dưới lên
print(df2)
df2.dropna(thresh = 2)

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0

In [37]:
# Những nơi nan thì thêm giá trị vào
df2.fillna(100)

       0      1      2
0    1.0    2.0    3.0
1    4.0  100.0    6.0
2  100.0    8.0  100.0
3  100.0  100.0  100.0

In [40]:
df2.fillna(0, inplace = False)
df2

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  6.0
2  0.0  8.0  0.0
3  0.0  0.0  0.0

In [41]:
df2.fillna(0, inplace = True)
df2

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  6.0
2  0.0  8.0  0.0
3  0.0  0.0  0.0